app/controllers/activities_controller.rb

  	def index
        @activities = Activity.all(:order => "task")
---
SELECT "activities".* FROM "activities" ORDER BY created_at desc

	def manage
		@activity = Activity.new

        @activities = Activity.all(:order => "task")
---
SELECT "activities".* FROM "activities" ORDER BY created_at desc

	def create

		puts params[:activity]

		#@activity = Activity.new(params[:activity])
		@activity = Activity.new(:task => params[:activity][:task], :times =>0 )

		if @activity.valid? and @activity.save

			redirect_to activities_manage_path, :flash => {:notice => "Activity created"}

		else

			@activity = Activity.new

        	@activities = Activity.all(:order => "task")
---
INSERT INTO "activities" ("created_at", "task", "times", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 25 May 2013 13:39:12 UTC +00:00], ["task", "strategy"], ["times", 0], ["updated_at", Sat, 25 May 2013 13:39:12 UTC +00:00]]
SELECT "activities".* FROM "activities" ORDER BY created_at desc

	def addonetocounter()

		return unless request.xhr?
	  	return unless request.post?

		#add 1 to counter for activity count
		@activity = Activity.find_by_task(params[:activity])

		#read current value for activity
		oldtimes = @activity.times
		#add one to counter and update
		@activity.times = oldtimes +1

		@activity.save
---
SELECT "activities".* FROM "activities" WHERE "activities"."task" = 'ops' LIMIT 1
UPDATE "activities" SET "times" = 1, "updated_at" = '2013-06-03 03:44:21.489790' WHERE "activities"."id" = 3

	def resetcounters()

		#Get counter
		@activities = Activity.all

		if @activities !=nil then

			#Set all activities
			for activity in @activities do
				activity.times = 0

				activity.save
---
SELECT "activities".* FROM "activities"
UPDATE "activities" SET "times" = 0, "updated_at" = '2013-06-03 09:29:36.417600' WHERE "activities"."id" = 1

	def resetactivities()

		Activity.delete_all
---
DELETE FROM "activities"

	def results
		@activities = Activity.all(:order => "created_at desc")
---
SELECT "activities".* FROM "activities" ORDER BY created_at desc

	def destroy

    	@activity = Activity.find(params[:id])

    	@activity.delete

    	@activity = Activity.new

        @activities = Activity.all(:order => "created_at desc")
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT 1  [["id", "11"]]
DELETE FROM "activities" WHERE "activities"."id" = 11
SELECT "activities".* FROM "activities" ORDER BY created_at desc